[
 {
    "name":"Mentorship Craft Social",
    "title_url":"",
    "link_type": 0,
    "date_string":"Feburary 4th",
    "date":"February 4 2025",
    "time":"7:00 - 8:00 PM\n",
    "location":"Bowen Ohio Room",
    "location_url":"",
    "desc": "Kick off the Spring semester with the ACM-W Mentorship Program! Join us for our first meeting featuring fun activities like Legos, watercolor bookmarks, and coloring books, all while bonding with your Big or Little. Everyone is welcome to attend and apply to join the program! Refreshments, craft supplies, and good company provided!",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"OSU STEM Day",
    "title_url":"",
    "link_type": 0,
    "date_string":"Feburary 1st",
    "date":"February 1 2025",
    "time":"10:30 AM - 1:00 PM\n",
    "location":"Fontana Labs",
    "location_url":"",
    "desc": "STEM Day is an interactive outreach event hosted at OSU’s Fontana Laboratories that introduces middle and high school students to engineering through facility tours and hands-on activities led by student organizations. Attendees rotate through small-group sessions, engage with volunteers, and explore different STEM disciplines in a fun, supportive environment.",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Northside Branch Volunteering",
    "title_url":"",
    "link_type": 0,
    "date_string":"January 30th",
    "date":"January 30 2025",
    "time":"4:00 PM\n",
    "location":"Northside Branch CML",
    "location_url":"",
    "desc": "Start off the new year with ACM-W at our Vision Board Making Event! Bring your aspirations to life by crafting a personalized vision board filled with images and words that reflect your ambitions for 2026. Materials will be provided.",
    "rsvp":"Sign-up & RSVP Here",
    "rsvp_link":"https://forms.gle/3qp32oC2fRBcECgm8"
  },
  {
    "name":"Vision Board Social",
    "title_url":"",
    "link_type": 0,
    "date_string":"January 28th",
    "date":"January 28 2025",
    "time":"7:00 - 8:00 PM\n",
    "location":"Raney Bolder Room",
    "location_url":"",
    "desc": "Start off the new year with ACM-W at our Vision Board Making Event! Bring your aspirations to life by crafting a personalized vision board filled with images and words that reflect your ambitions for 2026. Materials will be provided.",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Job Fair Prep Jamboree",
    "title_url":"",
    "link_type": 0,
    "date_string":"January 21st",
    "date":"January 21 2025",
    "time":"7:00 - 8:00 PM\n",
    "location":"Busch Valor Room",
    "location_url":"",
    "desc": "Join us for an interactive career fair preparation event. We will have stations for you to get your resume reviewed, enhance your LinkedIn profile, practice your elevator pitch, and more. Whether you're looking for an internship or a full time role, just starting your job search, or looking to refine your skills, this event is for you!",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Spring Kickoff 2025",
    "title_url":"",
    "link_type": 0,
    "date_string":"January 14th",
    "date":"January 14 2025",
    "time":"7:00 - 8:00 PM\n",
    "location":"Raney Bolder Room",
    "location_url":"",
    "desc": "Discover a welcoming community for women and nonbinary individuals in technology! If you're seeking professional development or connections in tech, this is the perfect opportunity. Join ACM-W for our first Spring event featuring a preview of exciting upcoming events this semester, accompanied by delicious Adriatico's pizza. Stick around afterward for fun activities to connect and bond with fellow members. We can't wait to see you there!",
    "rsvp":"",
    "rsvp_link":""
  },

  {
    "name":"Career Fair Ready With JPMorgan Chase & Co.",
    "title_url":"",
    "link_type": 0,
    "date_string":"September 17th",
    "date":"September 17 2025",
    "time":"7:00 - 8:00 PM\n",
    "location":"1874 Houston House",
    "location_url":"",
    "desc": "Join us on September 17th from 7–8 PM for an exclusive workshop with JPMC designed to sharpen your recruiting skills and boost your confidence before career fair season.",
    "rsvp":"RSVP Here",
    "rsvp_link":"https://forms.gle/Te7b3Nifnxpvu2HYA"
  },

{
    "name":"Introduction to Mentorship Social",
    "title_url":"",
    "link_type": 0,
    "date_string":"September 10th",
    "date":"September 10 2025",
    "time":"7:00 - 8:00 PM\n",
    "location":"1874 Houston House",
    "location_url":"",
    "desc": "Event to introduce interested students to ACM-W Mentorship program. Pairs under and upperclassmen to guide younger students through their experience in computing at Ohio State. Provide and spread a group forum of resources for students to refer to. Will have FREE pizza!!",
    "rsvp":"Interest Form",
    "rsvp_link":" https://forms.gle/Hn5wn3uU54WPBJKs7"
  },
  
{
    "name":"Captech Interview + Recruitment Workshop",
    "title_url":"",
    "link_type": 0,
    "date_string":"September 3rd",
    "date":"September 3 2025",
    "time":"7:00 - 8:00 PM\n",
    "location":"1874 Houston House",
    "location_url":"",
    "desc": "We’re excited to host an exclusive CapTech workshop that will give you the inside scoop on how to stand out in the recruitment process. CapTech recruiters will be on-site accepting resumes, sharing exactly what they look for in top candidates, and providing guidance on how to shine in both behavioral and technical interviews. You’ll walk away with actionable strategies to boost your confidence and performance in future interviews. Plus, the event will be catered with food from Noodles & Company — come hungry and ready to learn!",
    "rsvp":"RSVP Here",
    "rsvp_link":"https://forms.gle/YSix2HXMBzQ9i3RcA"
  },

  {
    "name":"Fall Kickoff 2025",
    "title_url":"",
    "link_type": 0,
    "date_string":"August 27th",
    "date":"August 27 2025",
    "time":"7:00 - 8:00 PM\n",
    "location":"Raney Bolder Room",
    "location_url":"",
    "desc": "Come join ACM-W for our Fall Kickoff event to learn more about who we are, what we do, and how we support gender minorities in technology at Ohio State! We’ll introduce our executive board, share how we advocate for inclusive spaces in tech, and highlight opportunities to get involved in our mentorship program, professional devolpment opportunities and outreach. Hot pizza from Adriatico's will be served!",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Ice Cream Social",
    "title_url":"",
    "link_type": 0,
    "date_string":"August 25th",
    "date":"August 25 2025",
    "time":"7:00 - 8:00 PM\n",
    "location":"Browning Amphitheater @ Mirror Lake",
    "location_url":"",
    "desc": "Join ACM-W for our first event of the year! Come meet fellow members, play light-hearted icebreaker games, and cool off with a scoop (or two) while learning more about our community and upcoming events. ",
    "rsvp":"",
    "rsvp_link":""
  },

  {
    "name":"Mentorship Monthly Study Group: Mocktail Night",
    "title_url":"",
    "link_type": 0,
    "date_string":"April 21st",
    "date":"April 21 2025",
    "time":"4:00 - 6:00 PM\n",
    "location":"Nosker Marion Room (119)",
    "location_url":"",
    "desc": "Finals are coming up—let’s study together! Join ACM-W for a fun and productive Mentorship Study Group: Mocktail Night! Anyone is welcome to prep for exams, regardless of Mentorship program participation. Enjoy some chips, mix up a refreshing mocktail, and get ready to ace your finals with your ACM-W community!",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Cupcakes & Cheers: A Sweet Send-Off",
    "title_url":"",
    "link_type": 0,
    "date_string":"April 16th",
    "date":"April 16 2025",
    "time":"7:00 - 8:00 PM\n",
    "location":"Houston 1874",
    "location_url":"",
    "desc": "Join us for a fun and festive evening of decorating cupcakes, celebrating the end of the year, and sharing some sweet moments with friends! Come for the creativity, stay for the snacks, and let’s make this year’s send-off extra sweet! 🎉🧁",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Mentorship Bob Ross Mini Painting Night",
    "title_url":"",
    "link_type": 0,
    "date_string":"April 9th",
    "date":"April 9 2025",
    "time":"7:00 - 8:00 PM\n",
    "location":"Houston 1874",
    "location_url":"",
    "desc": "Unleash your inner artist at the Mentorship Bob Ross Mini Painting Night! ACM-W members will receive a mini easel, palette, paintbrushes, and paints to follow along with a fun Bob Ross tutorial. Whether you're a seasoned painter or a first-timer, come enjoy a relaxing evening of creativity, laughter, and positive vibes. No experience required—just bring your enthusiasm and get ready to paint happy little trees with your mentorship pair! All materials provided.",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"ArchE Week Trivia",
    "title_url":"",
    "link_type": 0,
    "date_string":"April 2nd",
    "date":"April 2 2025",
    "time":"7:00 - 8:00 PM\n",
    "location":"Houston 1874",
    "location_url":"",
    "desc": "Join us for our annual ArchE Week Trivia Night! Gather your team of up to three and put your knowledge to the test. Enjoy free Chipotle and compete for a chance to win exciting prizes. Don't miss out on a night of fun, food, and friendly competition!",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Mentorship Escape Room",
    "title_url":"",
    "link_type": 0,
    "date_string":"March 26th",
    "date":"March 26 2025",
    "time":"7:00 - 8:00 PM\n",
    "location":"Houston 1874",
    "location_url":"",
    "desc": "Get ready for a thrilling challenge at our Mentorship Escape Room! Join us for a fun, team-building experience where you'll work together with your mentor or mentee to solve puzzles, crack codes, and escape the room before time runs out. It’s the perfect opportunity to strengthen your collaboration skills, bond with your mentorship pair, and enjoy some friendly competition. Will you escape in time? Come find out!",
    "rsvp":"",
    "rsvp_link":""
  },

  {
    "name":"Google Speaker Panel",
    "title_url":"",
    "link_type": 0,
    "date_string":"March 19th",
    "date":"March 19 2025",
    "time":"7:00 - 8:00 PM\n",
    "location":"Houston 1874",
    "location_url":"",
    "desc": "Join ACM-W OSU for an insightful panel discussion featuring Ohio State alumni who now work at Google! Discover their unique journeys to one of the world’s top tech companies and gain invaluable advice on the technical and behavioral interview process. Whether you're preparing for an internship or a full-time role, this event will provide practical tips and inspiration for your career path.",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Accenture Tech Talk",
    "title_url":"",
    "link_type": 0,
    "date_string":"March 5th",
    "date":"March 5 2025",
    "time":"7:00 - 8:00 PM\n",
    "location":"Houston 1874",
    "location_url":"",
    "desc": "Join us for an insightful hybrid panel discussion with Piyush Sharma, an OSU alum currently at Accenture. Learn about their experiences at OSU, their career path, and how they navigated the journey to Accenture. This is a great opportunity to gain insider tips, ask questions, and understand what it takes to succeed in the consulting and tech industry.",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"GHC and Exec Info Session",
    "title_url":"",
    "link_type": 0,
    "date_string":"March 3rd",
    "date":"March 3 2025",
    "time":"7:00 - 8:00 PM\n",
    "location":"Houston 1874",
    "location_url":"",
    "desc": "Come join us for an overview of the Grace Hopper Celebration and how to qualify for an ACM-W scholarship. We will also be going over ACM-W executive board positions and how to apply for available positions. If you are not able to attend and are interested, please keep an eye out on our slack for more information.",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Introduction to Open Source w/ OSC",
    "title_url":"",
    "link_type": 0,
    "date_string":"February 26th",
    "date":"February 26 2025",
    "time":"7:00 - 8:00 PM\n",
    "location":"Houston 1874",
    "location_url":"",
    "desc": "Curious about open source and how it affects you as a developer? Join ACM-W and Open Source Club for an introduction to open source! Learn how open source shapes the tech industry, discover ways to integrate it into your daily workflow, and explore how contributing to open source connects you with the larger Free and Open Source Software (FOSS) community. Whether you're new to open source or looking to deepen your involvement, this event will provide valuable insights and resources to get started. Free pizza from Adriaticos will be provided alongside trivia with a prize. ",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Application to Major Office hours and Study Group",
    "title_url":"",
    "link_type": 0,
    "date_string":"February 17th",
    "date":"February 17 2025",
    "time":"4:00 - 7:00 PM\n",
    "location":"Nosker Marion Room",
    "location_url":"",
    "desc": "Drop by Application to Major Office Hours and Study Group to chat with your mentor and ACM-W exec board members about your application! We're here to help with brainstorming, essay proofreading, or any questions you may have. If you're not applying, feel free to use the time to get some work done and relax! Boba will be provided!",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Eating with Industry",
    "title_url":"",
    "link_type": 0,
    "date_string":"February 5th",
    "date":"February 5 2025",
    "time":"6:00 - 8:00 PM\n",
    "location":"Curl Viewpoint",
    "location_url":"",
    "desc": "Join ACM-W for our biggest networking event of the semester, Eating with Industry! This is your chance to connect with representatives from JP Morgan Chase, Accenture, CapTech, and CAS over a casual, welcoming meal. Whether you're exploring potential career opportunities, seeking advice on landing internships, or simply curious about what these top companies have to offer, this event is a great opportunity to expand your professional network and gain valuable insights.",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Mentorship Craft Night",
    "title_url":"",
    "link_type": 0,
    "date_string":"February 5th",
    "date":"February 5 2025",
    "time":"7:00 - 8:00 PM\n",
    "location":"Houston 1874",
    "location_url":"",
    "desc": "Kick off the Spring semester with the ACM-W Mentorship Program! Join us for our first meeting featuring fun activities like Legos, watercolor bookmarks, and coloring books, all while bonding with your Big, Little, and House. Everyone is welcome to attend and apply to join the program! Refreshments, craft supplies, and good company provided!",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Vision Board Making Social",
    "title_url":"",
    "link_type": 0,
    "date_string":"January 29th",
    "date":"January 29 2025",
    "time":"7:00 - 8:00 PM\n",
    "location":"Houston 1874",
    "location_url":"",
    "desc": "Start off the new year with ACM-W at our Vision Board Making Event! Bring your aspirations to life by crafting a personalized vision board filled with images and words that reflect your ambitions for 2025. Materials will be provided.",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Job Fair Prep Jamboree",
    "title_url":"",
    "link_type": 0,
    "date_string":"January 22nd",
    "date":"January 22 2025",
    "time":"7:00 - 8:00 PM\n",
    "location":"Houston 1874",
    "location_url":"",
    "desc": "Get ready for the SWE Career Fair with ACM-W! Join us for an interactive career fair preparation event. We will have stations for you to get your resume reviewed, enhance your LinkedIn profile, practice your elevator pitch, and more. Whether you're looking for an internship or a full time role, just starting your job search, or looking to refine your skills, this event is for you!",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Spring Kickoff 2025",
    "title_url":"",
    "link_type": 0,
    "date_string":"January 15th",
    "date":"January 15 2025",
    "time":"7:00 - 8:00 PM\n",
    "location":"Houston 1874",
    "location_url":"",
    "desc": "Discover a welcoming community for women and nonbinary individuals in technology! If you're seeking professional development or connections in tech, this is the perfect opportunity. Join ACM-W for our first Spring event featuring a preview of exciting upcoming activities this semester, accompanied by delicious Adriatico's pizza. Stick around afterward for fun games to connect and bond with fellow members. We can't wait to see you there!",
    "rsvp":"",
    "rsvp_link":""
  },

  {
    "name":"Mentorship Monthly Study Group",
    "title_url":"",
    "link_type": 0,
    "date_string":"December 2nd",
    "date":"December 2 2024",
    "time":"4:00 - 7:00 PM \n",
    "location":"Busch Courage Room",
    "location_url":"",
    "desc": "CGetting ready for finals? Join our ACM-W Mentorship Study Group! Whether you’re meeting with your mentor, studying with your mentee, or just looking for a productive study session, come hang out, work together, and get your questions answered!",
    "rsvp":"",
    "rsvp_link":""
  },

  {
    "name":"Holiday Social",
    "title_url":"",
    "link_type": 0,
    "date_string":"November 20th",
    "date":"November 20 2024",
    "time":"7:00 - 8:00 PM \n",
    "location":"Dreese 317",
    "location_url":"",
    "desc": "Celebrate the season with ACM-W at our annual Holiday Social! Enjoy an evening filled with cozy winter crafts, tasty treats, and steaming hot cocoa. It’s the perfect way to get into the holiday spirit, have fun, and make memories with friends.",
    "rsvp":"",
    "rsvp_link":""
  },

  {
    "name":"Mentorship Bracelet Making Social",
    "title_url":"",
    "link_type": 0,
    "date_string":"November 6th",
    "date":"November 6 2024",
    "time":"7:00 - 8:00 PM \n",
    "location":"Dreese 317",
    "location_url":"",
    "desc": "Join our Bracelet Making Social to unwind, get creative, and connect with our Mentorship groups! Anyone can attend to join our Mentorship Program. All bracelet making materials will be provided, and refreshments are on us. See you there!",
    "rsvp":"",
    "rsvp_link":""
  },

  {
    "name":"CSE Halloween Social",
    "title_url":"",
    "link_type": 0,
    "date_string":"October 30th",
    "date":"October 30 2024",
    "time":"7:00 - 8:00 PM \n",
    "location":"Blackburn Victory Room",
    "location_url":"",
    "desc": "Join ACM-W and other CSE organizations for a spooktacular Halloween celebration filled with thrilling activities and a costume contest! Wear your best costume for a chance to win exciting prizes. Don’t miss out on the fun!",
    "rsvp":"",
    "rsvp_link":""
  },

  {
    "name":"Case Study Competition w/ Accenture",
    "title_url":"",
    "link_type": 0,
    "date_string":"October 23rd",
    "date":"October 23 2024",
    "time":"7:00 PM \n",
    "location":"Pomerene Hall 150",
    "location_url":"",
    "desc": "Get ready to put your problem-solving skills to the test! ACM-W and Accenture are teaming up for an exciting case study competition where you'll tackle real-world challenges and present your innovative solutions to a panel of industry experts. Work in teams, think on your feet, and experience what it's like to solve complex problems just like the pros",
    "rsvp":"Sign-up & RSVP Here",
    "rsvp_link":"https://docs.google.com/spreadsheets/d/1i1yjFqwkYzz6V15y-PbFSPzKX-1hkpRKa7fmo45bQpA/edit?usp=sharing"
  },

  {
    "name":"Pumpkin Patch Trip",
    "title_url":"",
    "link_type": 0,
    "date_string":"October 19th",
    "date":"October 19 2024",
    "time":"11:00 AM \n",
    "location":"Lynd's Fruit Farm",
    "location_url":"",
    "desc": "An outing at the Pumpkin Patches",
    "rsvp":"",
    "rsvp_link":""
  },

  {
    "name":"Mentorship Rubber Duckie Social",
    "title_url":"",
    "link_type": 0,
    "date_string":"October 2nd",
    "date":"October 2 2024",
    "time":"7:00 - 8:00 PM\n",
    "location":"Dreese 264",
    "location_url":"",
    "desc": "Bond with your mentors and mentees while making cute rubber duckies!",
    "rsvp":"",
    "rsvp_link":""
  },

  {
    "name":"LeetCode Workshop",
    "title_url":"",
    "link_type": 0,
    "date_string":"September 25th",
    "date":"September 25 2024",
    "time":"7:00 - 8:00 PM\n",
    "location":"Dreese 264",
    "location_url":"",
    "desc": "Join us to learn how to practice Leetcode questions to tackle software engineering technical interviews. We will be discussing resources on how to prepare, tips, as well as go through some questions together. All genders and majors of all experience levels are welcome! ",
    "rsvp":"",
    "rsvp_link":""
  },

  {
    "name":"Capital One Networking and personal branding workshop",
    "title_url":"",
    "link_type": 0,
    "date_string":"September 18th",
    "date":"September 18 2024",
    "time":"7:00 - 8:00 PM\n",
    "location":"Houston 1874",
    "location_url":"",
    "desc": "Join ACM-W for an networking and personal branding workshop hosted in collaboration with Capital One, where you'll learn essential strategies to elevate your professional presence and expand your network. Connect with industry experts, gain insights into effective personal branding techniques, and cultivate valuable connections to propel your career forward.",
    "rsvp":"RSVP here",
    "rsvp_link":"https://forms.gle/XZVwtru4MbUXqpkX6"
  },
  
  {
    "name":"Career Fair Prep with JP Morgan Chase and Co.",
    "title_url":"",
    "link_type": 0,
    "date_string":"September 12th",
    "date":"September 12 2024",
    "time":"7:00 - 8:00 PM\n",
    "location":"Pomerene Hall 280",
    "location_url":"",
    "desc": "Kickstart your recruiting season with expert guidance from JPMorgan Chase & Co. at our Career Fair Prep event! Join us on September 13th from 7-8pm for an insightful session where representatives from JPMC will help you perfect your resume, refine your elevator pitch, and navigate the career fair with confidence. You'll also gain valuable tips on appropriate dress codes and effective follow-up strategies after meeting with recruiters. Catering will be provided. Don't miss this opportunity to enhance your career prospects with one of the industry's leading firms!",
    "rsvp":"RSVP here",
    "rsvp_link":"https://forms.gle/v92j1sfwRpaGKRkn7"
  },

  {
    "name":"Introduction to Mentorship Social",
    "title_url":"",
    "link_type": 0,
    "date_string":"September 9th",
    "date":"September 9 2024",
    "time":"7:00 - 8:00 PM\n",
    "location":"Dreese 266",
    "location_url":"",
    "desc": "Event to introduce interested students to ACM-W Mentorship program. Pairs under and upperclassmen to guide younger students through their experience in computing at Ohio State. Create groups of students (houses) to provide academic help amongst one another. Provide and spread a group forum of resources for students to refer to.Free pizza!",
    "rsvp":"Interest Form",
    "rsvp_link":"https://forms.gle/s1z2P8yRyi66uB7x9"
  },

  {
    "name":"Captech Interview and Recruitment Workshop",
    "title_url":"",
    "link_type": 0,
    "date_string":"September 4th",
    "date":"September 4 2024",
    "time":"7:00 - 8:00 PM\n",
    "location":"Pomerene 150",
    "location_url":"",
    "desc": "Join us for an exclusive workshop with CapTech, designed to help you navigate the recruitment process and excel in both behavioral and technical interviews. Learn directly from CapTech's recruiters about what they look for, how to effectively answer interview questions, and tips for succeeding in technical assessments. This event is your opportunity to gain valuable insights and advance your career.",
    "rsvp":"RSVP Here",
    "rsvp_link":"https://forms.gle/k7YiXyf57aiDyswv7"
  },
  {
    "name":"Fall Kick Off 2024",
    "title_url":"",
    "link_type": 0,
    "date_string":"August 28th",
    "date":"August 28 2024",
    "time":"7:00 - 8:00 PM\n",
    "location":"Houston House 1874 Room",
    "location_url":"",
    "desc": "Step into a new season with us and explore the incredible opportunities awaiting you! Our Fall Kickoff Event is the perfect chance to learn about the exciting initiatives, career advancements, and vibrant social activities our organization has in store. Pizza and drinks are provided!",
    "rsvp":"",
    "rsvp_link":""
  },

  {
    "name":"Ice Cream Social",
    "title_url":"",
    "link_type": 0,
    "date_string":"August 21st",
    "date":"August 21 2024",
    "time":"7:00 - 8:00 PM\n",
    "location":"Mirror Lake Amphitheater",
    "location_url":"",
    "desc": "Join ACM-W for our first event of the year! Come meet fellow members, play light-hearted icebreaker games, and cool off with a scoop (or two) while learning more about our community and upcoming events.",
    "rsvp":"",
    "rsvp_link":""
  },
  
  {
  "name":"Deep Learning with Capital One",
  "title_url":"",
  "link_type": 0,
  "date_string":"April 11th",
  "date":"April 11 2024",
  "time":"6:00 - 7:30 PM\n",
  "location":"Pomerene 160" ,
  "location_url":"",
  "desc": "Join ACM-W and Capital One discover the power of deep learning and gain exclusive insights into Capital One's innovative applications as well as networking with Capital One employees before the start of next year's recruiting season. Uncover the intersection of cutting-edge technology and real-world finance, and ignite your curiosity in the realm of AI-driven solutions",
  "rsvp_link":"https://go.osu.edu/deep-learning-capital-one"
  },
  {
    "name":"Mentorship Craft Day",
    "title_url":"",
    "link_type": 0,
    "date_string":"April 10th",
    "date":"April 10 2024",
    "time":"7:00 - 8:00 PM\n",
    "location":"Dreese 264" ,
    "location_url":"",
    "desc": "Join us for our last mentorship event for the 2023-2024 school year! This is an awesome opportunity to bond with mentorship teams and relax with fun crafts. ",
    "rsvp_link":""
  },
  {
    "name":"Shar Dubey and Mandy Ginsberg Fireside Chat",
    "title_url":"",
    "link_type": 0,
    "date_string":"March 27th",
    "date":"March 27 2024",
    "time":"7:00 - 8:00 PM\n",
    "location":"Pomerene 150" ,
    "location_url":"",
    "desc": "Join us for an insightful fireside chat featuring two former CEOs of the Match Group, Shar Dubey and Mandy Ginsberg. Together, they'll share their perspectives on what it's like to be leaders in the male dominated technology industry.",
    "rsvp_link":""
  },
  {
    "name":"Women's History Month Lean-in circle",
    "title_url":"",
    "link_type": 0,
    "date_string":"March 20th",
    "date":"March 20 2024",
    "time":"7:00 - 8:00 PM\n",
    "location":"Dreese 264" ,
    "location_url":"",
    "desc": "Join us as we check up on each others mental health at this tough point in the semester. This is a safe space to open up to about life’s difficulties and provide love and support to one another <3 Panera will be provided!",
    "rsvp_link":""
  },
  {
    "name":"GHC & Exec Application Info Session",
    "title_url":"",
    "link_type": 0,
    "date_string":"March 6th",
    "date":"March 6 2024",
    "time":"7:00 - 8:00 PM\n",
    "location":"Dreese 264" ,
    "location_url":"",
    "desc": "Interested in joining our executive board and being a more involved club member? Interested in one of our Grace Hopper Celebration scholarships? At this event we will discuss our application processes for both of these wonderful opportunities.",
    "rsvp_link":""
  },
  {
    "name":"Workplace harassment seminar w/ SARNCO",
    "title_url":"",
    "link_type": 0,
    "date_string":"February 28th",
    "date":"February 28 2024",
    "time":"7:00 - 8:00 PM\n",
    "location":"Dreese 264",
    "location_url":"",
    "desc": "Join SARNCO for an interactive discussion on workplace harrasment, with a focus on women in technology. We'll also have coloring sheets available to work on during the discussion. ",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Binary Bracelets Community Service with 4H",
    "title_url":"",
    "link_type": 0,
    "date_string":"February 28th",
    "date":"February 28 2024",
    "time":"7:00 - 8:30 PM\n",
    "location":"4H Center",
    "location_url":"",
    "desc": "This awesome community outreach event is partnered with 4H! We will be making binary bracelets with the children and having lots of fun.",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Application to Major Office Hours",
    "title_url":"",
    "link_type": 0,
    "date_string":"February 19th",
    "date":"February 19 2024",
    "time":"4:15 - 7:15 PM\n",
    "location":"tbd",
    "location_url":"",
    "desc": "Stop by to chat with ACM-W exec board members about your application to major! While we cannot guarantee we know exactly how to get admitted, we're available to help brainstorm and proofread essays. If you're not applying, feel free to ask about academics, professional development, and our experience in CS at OSU - or just hang out with us.",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Palentines Day Social",
    "title_url":"",
    "link_type": 0,
    "date_string":"February 14th",
    "date":"February 14 2024",
    "time":"7:00 - 8:00 PM\n",
    "location":"Dreese 264",
    "location_url":"",
    "desc": "Join us for an awesome Valentine celebration with fun snacks, activities, games and friends <3",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Eating with Industry",
    "title_url":"",
    "link_type": 0,
    "date_string":"February 8th",
    "date":"February 8 2024",
    "time":"7:00 - 8:00 PM\n",
    "location":"Curl Viewpoint",
    "location_url":"",
    "desc": "Join ACM-W for an exclusive event to network with industry partners such as JPMORGAN CHASE & CO, CapTech, Fiserv and more over dinner! RSVP with the link to reserve your spot. Dress code is Business Casual and feel free to bring your resume!",
    "rsvp":"RSVP to this super popular event",
    "rsvp_link":"http://go.osu.edu/eatwithindustry"
  },
  {
    "name":"Vision Board Making",
    "title_url":"",
    "link_type": 0,
    "date_string":"January 31st",
    "date":"January 31 2024",
    "time":"7:00 - 8:00 PM\n",
    "location":"Dreese 264",
    "location_url":"",
    "desc": "Start off the new year with ACMW at our Vision Board Making Event! Bring your aspirations to life by crafting a personalized vision board filled with images and words that reflect your ambitions for 2024. ",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"FAST Enterprises Trivia Night",
    "title_url":"",
    "link_type": 0,
    "date_string":"January 30th",
    "date":"January 30 2024",
    "time":"7:00 - 8:00 PM\n",
    "location":"Dreese 264",
    "location_url":"",
    "desc": "Join us for a fun trivia session with prizes while networking with representatives from the software Consulting Company, FAST Enterprises. Pizza and soda will be provided! ",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Accenture Case Study Competition",
    "title_url":"",
    "link_type": 0,
    "date_string":"January 24th",
    "date":"January 24 2024",
    "time":"7:30 - 8:30 PM\n",
    "location":"Dreese 264",
    "location_url":"",
    "desc": "Learn skills in performing case studies given various technology based prompts. Useful skills for consulting interviews, network with Accenture professionals and more!",
    "rsvp":"RSVP to this company event!",
    "rsvp_link":"go.osu.edu/acmwcasestudy"
  },
  {
    "name":"Bracelet Making Social",
    "title_url":"",
    "link_type": 0,
    "date_string":"January 22nd",
    "date":"January 22 2024",
    "time":"7:00 - 8:00 PM\n",
    "location":"Dreese 264",
    "location_url":"",
    "desc": "Join our Bracelet Making Social where you can unwind, get creative, and connect with your mentorship group. All materials provided, and refreshments are on us! See you there!",
    "rsvp":"RSVP to this social",
    "rsvp_link":"go.osu.edu/bracelet-rsvp"
  },
  {
    "name":"Recruiting and Career Fair Prep Workshop",
    "title_url":"",
    "link_type": 0,
    "date_string":"January 17th",
    "date":"January 17 2024",
    "time":"7:00 - 8:00 PM\n",
    "location":"Dreese 264",
    "location_url":"",
    "desc": "Learn how to recruit for tech internships and jobs at this informational workshop! We will be discussing resumes, interviews, and various resources to help you navigate breaking into tech. Additionally, we will be going over some tips and tricks to help prepare for the upcoming career fairs! ",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Spring Kickoff",
    "title_url":"",
    "link_type": 0,
    "date_string":"January 10th",
    "date":"January 10 2024",
    "time":"7:00 - 8:00 PM\n",
    "location":"Pomerene 150",
    "location_url":"",
    "desc": "Are you looking for a community of women and nonbinary people in technology? Or opportunities for professional development? Join ACM-W for our first Spring event, as we talk about some upcoming events to look forward to this semester with some fresh pizza from Adriatico's. Afterwards, we will be playing family feud, so we hope to see you all there!",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Holiday Party",
    "title_url":"",
    "link_type": 0,
    "date_string":"November 29th",
    "date":"November 29 2023",
    "time":"7:00 - 8:00 PM\n",
    "location":"Dreese 264",
    "location_url":"",
    "desc": "Join us for an awesome Holiday party!",
    "rsvp":"",
    "rsvp_link":""
  }, 
  {
    "name":"Outreach @ Barnett Branch of Columbus Metro Library",
    "title_url":"",
    "link_type": 0,
    "date_string":"November 17th",
    "date":"November 17 2023",
    "time":"3:00 - 6:00 PM\n",
    "location":"Barnett Branch",
    "location_url":"",
    "desc": "Want to help inspire young students? Then come help with teaching Scratch and Coding to the youth at Columbus Metro Library",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Google Speaker Panel",
    "title_url":"",
    "link_type": 0,
    "date_string":"November 15th",
    "date":"November 15 2023",
    "time":"7:00 - 8:00 PM\n",
    "location":"Pomerene 150",
    "location_url":"",
    "desc": "A panel that explores the career paths and prior experiences of current Google employees with an open panel discussion format",
    "rsvp":"",
    "rsvp_link":""
  }, 
  {
    "name":"Cookie Decorating with Rewrite the Code and Women in Cybersecurity",
    "title_url":"",
    "link_type": 0,
    "date_string":"November 8th",
    "date":"November 8 2023",
    "time":"7:00 - 8:00 PM\n",
    "location":"Dreese 264",
    "location_url":"",
    "desc": "Join us for our combined event w/ Rewrite the Code & Women in Cybersecurity as we decorate cookies and make memories!!",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Daugherty Business Solutions Tech Talk",
    "title_url":"",
    "link_type": 0,
    "date_string":"November 1th",
    "date":"November 1 2023",
    "time":"7:00 - 8:00 PM\n",
    "location":"Dreese 264",
    "location_url":"",
    "desc": "Join consultants from Daugherty Business Solutions to learn about what it’s like to be a part of an IT Consulting Firm, and to hear more about our Daugherty University program for recent graduates entering the workforce",
    "rsvp":"",
    "rsvp_link":""
  }, 
  {
    "name":"CSE Halloween Social",
    "title_url":"",
    "link_type": 0,
    "date_string":"October 26th",
    "date":"October 26 2023",
    "time":"8:00 - 9:00 PM\n",
    "location":"Dreese 264",
    "location_url":"",
    "desc": "Join the CSE Organizations for a spooky halloween celebration, there will be snacks games and a costume contest! This social is an awesome opportunity to network with peers in your classes that are involved in similar organizations on campus :)",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Southwest Research Robotics and Software Engineering Presentation w/ GradSWE",
    "title_url":"",
    "link_type": 0,
    "date_string":"October 24th",
    "date":"October 24 2023",
    "time":"7:00 - 8:00 PM\n",
    "location":"tbd",
    "location_url":"",
    "desc": "Dr. Douglas Brooks will be exploring Southwest's Intelligent Systems Division in collaboration with GradSWE. Pizza will be provided!",
    "rsvp":"",
    "rsvp_link":""
  }, 
  {
    "name":"OSU STEM Day",
    "title_url":"",
    "link_type": 0,
    "date_string":"October 22th",
    "date":"October 22 2023",
    "time":"12:00 - 4:00 PM\n",
    "location":"Fontana Labs",
    "location_url":"",
    "desc": "Want to help inspire young students? Then come help with teaching Scratch and Coding to the youth at Fontana Labs",
    "rsvp":"",
    "rsvp_link":""
  }, 
  {
    "name":"Mentorship Rubber Duck Social",
    "title_url":"",
    "link_type": 0,
    "date_string":"October 18th",
    "date":"October 18 2023",
    "time":"7:00 - 8:00 PM\n",
    "location":"tbd",
    "location_url":"",
    "desc": "Our 1st mentorship event where all the girls are paired up with their respective bigs and littles. We will make ducks our of string, bond with our new friends and destress!",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Columbus Metro Library MLK Branch Outreach",
    "title_url":"",
    "link_type": 0,
    "date_string":"October 6th",
    "date":"October 6 2023",
    "time":"3:00 - 6:00 PM\n",
    "location":"Columbus Metro Library MLK Branch",
    "location_url":"",
    "desc": "Want to help inspire young students? Then come help with teaching Scratch and Coding to the youth at Columbus Metro Library",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"MC Dean Women in Tech Panel",
    "title_url":"",
    "link_type": 0,
    "date_string":"October 4th",
    "date":"October 4 2023",
    "time":"7:00 - 8:00 PM\n",
    "location":"Dreese 264",
    "location_url":"",
    "desc": "Learn about the experiences of different women engineers at M.C. Dean, get your career questions answered, and network with M.C. Dean's recruiters while enjoying delicious food.",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Coffee Chat with Marathon",
    "title_url":"",
    "link_type": 0,
    "date_string":"September 18th",
    "date":"September 18 2023",
    "time":"7:00 - 8:00 PM\n",
    "location":"Dreese 264",
    "location_url":"",
    "desc": "Enjoy bubble tea and Insomnia cookies while talking with Marathon Petroleum employees about their technology co-op program and learning about “a day in the life” of an Information Technologist.",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Career Fair Prep with JP Morgan Chase",
    "title_url":"",
    "link_type": 0,
    "date_string":"September 13th",
    "date":"September 13 2023",
    "time":"7:00 - 8:00 PM\n",
    "location":"Dreese 264",
    "location_url":"",
    "desc": "Are you ready for Career Fairs? Come to our event and get advice right from JP Morgan Chase recruiters themselves to make sure you are ready :)",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Destressing by Painting & Planting with Caterpillar",
    "title_url":"",
    "link_type": 0,
    "date_string":"September 12th",
    "date":"September 12 2023",
    "time":"6:30 - 7:30 PM\n",
    "location":"Dreese 264",
    "location_url":"",
    "desc": "Paint pots and plant succulents with Caterpillar while learning about destressing techniques before midterm season w/ Girls Who Code. Food from Qdoba will be provided!",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Intro to Mentorship",
    "title_url":"",
    "link_type": 0,
    "date_string":"September 7th",
    "date":"September 7 2023",
    "time":"7:00 - 8:00 PM\n",
    "location":"Busch Palette Room",
    "location_url":"",
    "desc": "Join ACM-W for our Big-Little Bit mentorship program kickoff! Our mentorship program pairs under- and upper-classmen to build relationships and provide support. This event will include an overview of our fall 2023 plans and an opportunity to meet potential bigs / littles. (Attendance is not required to partake in the program but we hope you can make it :) )",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"CapTech Recruitment Workshop",
    "title_url":"",
    "link_type": 0,
    "date_string":"September 6th",
    "date":"September 6 2023",
    "time":"7:00 - 8:00 PM\n",
    "location":"Dreese 264",
    "location_url":"",
    "desc": "A recruitment/interviewing workshop held by Rachel Emmoms from CapTech and an OSU alum who currently works at CapTech, Nyna Sayarath. Chick Fil A will be provided.",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Fall Kick-Off!",
    "title_url":"",
    "link_type": 0,
    "date_string":"August 30th",
    "date":"August 30 2023",
    "time":"7:00 - 8:00 PM\n",
    "location":"Dreese 113",
    "location_url":"",
    "desc": "Join us to learn about exciting new opportunities our organization has to offer, from career advancements to fun, relaxing socials! Get to know exec members and prospective members for this year! Pizza will be provided.",
    "rsvp":"",
    "rsvp_link":""
  },
  {
    "name":"Ice Cream Social",
    "title_url":"",
    "link_type": 0,
    "date_string":"August 23rd",
    "date":"August 23 2023",
    "time":"7:00 - 8:00 PM\n",
    "location":"Amphitheater by Mirror Lake",
    "location_url":"",
    "desc": "Enjoy ice cream and meet ACM-W!",
    "rsvp":"",
    "rsvp_link":""
  }
]